/******************scanf用法***************
******************scanf用法****************/

#include <stdio.h>
#include <string.h>

int main ( void ) {

	int a, b;		

	/*
	 * 1,转换格式前面加数字可以限定宽度
	 * 2,scanf读取限定的宽度直到遇见空白符(空格,制表符,回车)终止输入
	 */

	printf( "请输入一个5位的整数\n" );
	scanf( "%5d", &a );
	printf( "a=%d\n", a );
	/*
	 * 请输入一个5位的整数
		12345678
		a=12345   (678还在输入流中)
		请输入一个6位的整数,各分给两个变量
		123456
		a=678(上次流中残留的数据),b=123
	 */
	printf( "请输入一个6位的整数,各分给两个变量\n" );
	scanf( "%3d%3d", &a, &b );	
	printf( "a=%d,b=%d\n", a, b );
	
	return 0;
}

