#include <stdio.h>

//按位取反
int main( void ) {
	/*
	 *　1, 0001 按位取反之后 1110
	 *   　但是这个1110是补码形式，内存中就是这么存储的
	 *     而显示的时候，使用原码，所以要把补码转成原码
	 *  2, １的补码 1110，转成补码规则如下
	 *      >补码取反+1, 符号位[最高位]不动
	 *      1110( 补码 )---> (1)符号位不动1110--->取反(1001)-->+1( 1010 )
	 *      所以1010，最高位符号为1, 是负数，所以1010 = -2
	 *  3, 0001 1001( 25 )
	 *  	>取反(补码): 1110 0110 ( 0xe6 )
	 *  	>原码: 1001 1001
	 *  	>+1  : 1001 1010
	 *  	>10011010 = -( 16 + 8 + 2 ) = -26
	 *
	 *
	 */
	printf( "~1=%d\n", ~1 );
	printf( "~1=%#x\n", ~1 );
	printf( "~25=%d\n", ~25 );
	printf( "~25=%#x\n", ~25 );

	return 0;
}
